CREATE DATABASE HvostovDEM
GO
USE HvostovDEM
GO
/****** Object:  Table [dbo].[Заказ]    Script Date: 03.03.2026 20:24:38 ******/
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[Заказ](
	[Код] [varchar](50) NOT NULL,
	[Номер] [int] NOT NULL,
	[Артикул_товара] [varchar](6) NOT NULL,
	[Количество] [int] NOT NULL,
	[Дата] [date] NOT NULL,
	[Дата_доставки] [date] NOT NULL,
	[Код_пункта_выдачи] [int] NOT NULL,
	[Код_пользователя] [int] NOT NULL,
	[Код_получения] [int] NOT NULL,
	[Статус] [varchar](50) NOT NULL,
 CONSTRAINT [PK_Заказ] PRIMARY KEY CLUSTERED 
(
	[Код] ASC
)WITH (PAD_INDEX = OFF, STATISTICS_NORECOMPUTE = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS = ON, ALLOW_PAGE_LOCKS = ON, OPTIMIZE_FOR_SEQUENTIAL_KEY = OFF) ON [PRIMARY]
) ON [PRIMARY]
GO
/****** Object:  Table [dbo].[Пользователь]    Script Date: 03.03.2026 20:24:38 ******/
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[Пользователь](
	[Код] [int] NOT NULL,
	[Роль] [varchar](50) NOT NULL,
	[ФИО] [varchar](50) NOT NULL,
	[Логин] [varchar](50) NOT NULL,
	[Пароль] [varchar](50) NOT NULL,
 CONSTRAINT [PK_Пользователь] PRIMARY KEY CLUSTERED 
(
	[Код] ASC
)WITH (PAD_INDEX = OFF, STATISTICS_NORECOMPUTE = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS = ON, ALLOW_PAGE_LOCKS = ON, OPTIMIZE_FOR_SEQUENTIAL_KEY = OFF) ON [PRIMARY]
) ON [PRIMARY]
GO
/****** Object:  Table [dbo].[Пункт_выдачи]    Script Date: 03.03.2026 20:24:38 ******/
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[Пункт_выдачи](
	[Код] [int] NOT NULL,
	[Адрес] [varchar](50) NOT NULL,
 CONSTRAINT [PK_Пункт_выдачи] PRIMARY KEY CLUSTERED 
(
	[Код] ASC
)WITH (PAD_INDEX = OFF, STATISTICS_NORECOMPUTE = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS = ON, ALLOW_PAGE_LOCKS = ON, OPTIMIZE_FOR_SEQUENTIAL_KEY = OFF) ON [PRIMARY]
) ON [PRIMARY]
GO
/****** Object:  Table [dbo].[Товар]    Script Date: 03.03.2026 20:24:38 ******/
SET ANSI_NULLS ON
GO
SET QUOTED_IDENTIFIER ON
GO
CREATE TABLE [dbo].[Товар](
	[Артикул] [varchar](6) NOT NULL,
	[Наименование_товара] [varchar](50) NOT NULL,
	[Единица_измерения] [varchar](50) NOT NULL,
	[Цена] [varchar](50) NOT NULL,
	[Поставщик] [varchar](50) NOT NULL,
	[Производитель] [varchar](50) NOT NULL,
	[Категория_товара] [varchar](50) NOT NULL,
	[Действующая_скидка] [varchar](50) NOT NULL,
	[Количество] [varchar](50) NOT NULL,
	[Описание] [varchar](1000) NOT NULL,
	[Фото] [varchar](50) NULL,
 CONSTRAINT [PK_Товар] PRIMARY KEY CLUSTERED 
(
	[Артикул] ASC
)WITH (PAD_INDEX = OFF, STATISTICS_NORECOMPUTE = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS = ON, ALLOW_PAGE_LOCKS = ON, OPTIMIZE_FOR_SEQUENTIAL_KEY = OFF) ON [PRIMARY]
) ON [PRIMARY]
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'1', 1, N'А112Т4', 2, CAST(N'2025-02-27' AS Date), CAST(N'2025-04-20' AS Date), 1, 4, 901, N'Завершен')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'10', 10, N'S213E3', 5, CAST(N'2025-04-03' AS Date), CAST(N'2025-04-29' AS Date), 19, 4, 910, N'Новый ')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'11', 1, N'F635R4', 2, CAST(N'2025-02-27' AS Date), CAST(N'2025-04-20' AS Date), 1, 4, 901, N'Завершен')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'12', 2, N'G783F5', 1, CAST(N'2022-09-28' AS Date), CAST(N'2025-04-21' AS Date), 11, 1, 902, N'Завершен')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'13', 3, N'D572U8', 10, CAST(N'2025-03-21' AS Date), CAST(N'2025-04-22' AS Date), 2, 2, 903, N'Завершен')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'14', 4, N'D329H3', 4, CAST(N'2025-02-20' AS Date), CAST(N'2025-04-23' AS Date), 11, 3, 904, N'Завершен')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'15', 5, N'F635R4', 2, CAST(N'2025-03-17' AS Date), CAST(N'2025-04-24' AS Date), 2, 4, 905, N'Завершен')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'16', 6, N'G783F5', 1, CAST(N'2025-03-01' AS Date), CAST(N'2025-04-25' AS Date), 15, 1, 906, N'Завершен')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'17', 7, N'D572U8', 10, CAST(N'2025-02-28' AS Date), CAST(N'2025-04-26' AS Date), 3, 2, 907, N'Завершен')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'18', 8, N'D329H3', 4, CAST(N'2025-03-31' AS Date), CAST(N'2025-04-27' AS Date), 19, 3, 908, N'Новый ')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'19', 9, N'G432E4', 1, CAST(N'2025-04-02' AS Date), CAST(N'2025-04-28' AS Date), 5, 4, 909, N'Новый ')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'2', 2, N'H782T5', 1, CAST(N'2022-09-28' AS Date), CAST(N'2025-04-21' AS Date), 11, 1, 902, N'Завершен')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'20', 10, N'E482R4', 5, CAST(N'2025-04-03' AS Date), CAST(N'2025-04-29' AS Date), 19, 4, 910, N'Новый ')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'3', 3, N'J384T6', 10, CAST(N'2025-03-21' AS Date), CAST(N'2025-04-22' AS Date), 2, 2, 903, N'Завершен')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'4', 4, N'F572H7', 5, CAST(N'2025-02-20' AS Date), CAST(N'2025-04-23' AS Date), 11, 3, 904, N'Завершен')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'5', 5, N'А112Т4', 2, CAST(N'2025-03-17' AS Date), CAST(N'2025-04-24' AS Date), 2, 4, 905, N'Завершен')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'6', 6, N'H782T5', 1, CAST(N'2025-03-01' AS Date), CAST(N'2025-04-25' AS Date), 15, 1, 906, N'Завершен')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'7', 7, N'J384T6', 10, CAST(N'2025-02-28' AS Date), CAST(N'2025-04-26' AS Date), 3, 2, 907, N'Завершен')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'8', 8, N'F572H7', 5, CAST(N'2025-03-31' AS Date), CAST(N'2025-04-27' AS Date), 19, 3, 908, N'Новый ')
GO
INSERT [dbo].[Заказ] ([Код], [Номер], [Артикул_товара], [Количество], [Дата], [Дата_доставки], [Код_пункта_выдачи], [Код_пользователя], [Код_получения], [Статус]) VALUES (N'9', 9, N'B320R5', 5, CAST(N'2025-04-02' AS Date), CAST(N'2025-04-28' AS Date), 5, 4, 909, N'Новый ')
GO
INSERT [dbo].[Пользователь] ([Код], [Роль], [ФИО], [Логин], [Пароль]) VALUES (1, N'Администратор', N'Никифорова Весения Николаевна', N'94d5ous@gmail.com', N'uzWC67')
GO
INSERT [dbo].[Пользователь] ([Код], [Роль], [ФИО], [Логин], [Пароль]) VALUES (2, N'Администратор', N'Сазонов Руслан Германович', N'uth4iz@mail.com', N'2L6KZG')
GO
INSERT [dbo].[Пользователь] ([Код], [Роль], [ФИО], [Логин], [Пароль]) VALUES (3, N'Администратор', N'Одинцов Серафим Артёмович', N'yzls62@outlook.com', N'JlFRCZ')
GO
INSERT [dbo].[Пользователь] ([Код], [Роль], [ФИО], [Логин], [Пароль]) VALUES (4, N'Менеджер', N'Степанов Михаил Артёмович', N'1diph5e@tutanota.com', N'8ntwUp')
GO
INSERT [dbo].[Пользователь] ([Код], [Роль], [ФИО], [Логин], [Пароль]) VALUES (5, N'Менеджер', N'Ворсин Петр Евгеньевич', N'tjde7c@yahoo.com', N'YOyhfR')
GO
INSERT [dbo].[Пользователь] ([Код], [Роль], [ФИО], [Логин], [Пароль]) VALUES (6, N'Менеджер', N'Старикова Елена Павловна', N'wpmrc3do@tutanota.com', N'RSbvHv')
GO
INSERT [dbo].[Пользователь] ([Код], [Роль], [ФИО], [Логин], [Пароль]) VALUES (7, N'Авторизированный клиент', N'Михайлюк Анна Вячеславовна', N'5d4zbu@tutanota.com', N'rwVDh9')
GO
INSERT [dbo].[Пользователь] ([Код], [Роль], [ФИО], [Логин], [Пароль]) VALUES (8, N'Авторизированный клиент', N'Ситдикова Елена Анатольевна', N'ptec8ym@yahoo.com', N'LdNyos')
GO
INSERT [dbo].[Пользователь] ([Код], [Роль], [ФИО], [Логин], [Пароль]) VALUES (9, N'Авторизированный клиент', N'Ворсин Петр Евгеньевич', N'1qz4kw@mail.com', N'gynQMT')
GO
INSERT [dbo].[Пользователь] ([Код], [Роль], [ФИО], [Логин], [Пароль]) VALUES (10, N'Авторизированный клиент', N'Старикова Елена Павловна', N'4np6se@mail.com', N'AtnDjr')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (1, N'420151, г. Лесной, ул. Вишневая, 32')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (2, N'125061, г. Лесной, ул. Подгорная, 8')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (3, N'630370, г. Лесной, ул. Шоссейная, 24')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (4, N'400562, г. Лесной, ул. Зеленая, 32')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (5, N'614510, г. Лесной, ул. Маяковского, 47')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (6, N'410542, г. Лесной, ул. Светлая, 46')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (7, N'620839, г. Лесной, ул. Цветочная, 8')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (8, N'443890, г. Лесной, ул. Коммунистическая, 1')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (9, N'603379, г. Лесной, ул. Спортивная, 46')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (10, N'603721, г. Лесной, ул. Гоголя, 41')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (11, N'410172, г. Лесной, ул. Северная, 13')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (12, N'614611, г. Лесной, ул. Молодежная, 50')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (13, N'454311, г.Лесной, ул. Новая, 19')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (14, N'660007, г.Лесной, ул. Октябрьская, 19')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (15, N'603036, г. Лесной, ул. Садовая, 4')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (16, N'394060, г.Лесной, ул. Фрунзе, 43')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (17, N'410661, г. Лесной, ул. Школьная, 50')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (18, N'625590, г. Лесной, ул. Коммунистическая, 20')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (19, N'625683, г. Лесной, ул. 8 Марта')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (20, N'450983, г.Лесной, ул. Комсомольская, 26')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (21, N'394782, г. Лесной, ул. Чехова, 3')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (22, N'603002, г. Лесной, ул. Дзержинского, 28')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (23, N'450558, г. Лесной, ул. Набережная, 30')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (24, N'344288, г. Лесной, ул. Чехова, 1')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (25, N'614164, г.Лесной,  ул. Степная, 30')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (26, N'394242, г. Лесной, ул. Коммунистическая, 43')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (27, N'660540, г. Лесной, ул. Солнечная, 25')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (28, N'125837, г. Лесной, ул. Шоссейная, 40')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (29, N'125703, г. Лесной, ул. Партизанская, 49')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (30, N'625283, г. Лесной, ул. Победы, 46')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (31, N'614753, г. Лесной, ул. Полевая, 35')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (32, N'426030, г. Лесной, ул. Маяковского, 44')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (33, N'450375, г. Лесной ул. Клубная, 44')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (34, N'625560, г. Лесной, ул. Некрасова, 12')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (35, N'630201, г. Лесной, ул. Комсомольская, 17')
GO
INSERT [dbo].[Пункт_выдачи] ([Код], [Адрес]) VALUES (36, N'190949, г. Лесной, ул. Мичурина, 26')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'B320R5', N'Туфли', N'шт.', N'4300', N'Kari', N'Rieker', N'Женская обувь', N'2', N'6', N'Туфли Rieker женские демисезонные, размер 41, цвет коричневый', N'9.jpg')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'B431R5', N'Ботинки', N'шт.', N'2700', N'Обувь для вас', N'Rieker', N'Мужская обувь', N'2', N'5', N'Мужские кожаные ботинки/мужские ботинки', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'C436G5', N'Ботинки', N'шт.', N'10200', N'Kari', N'Alessio Nesca', N'Женская обувь', N'15', N'9', N'Ботинки женские, ARGO, размер 40', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'D268G5', N'Туфли', N'шт.', N'4399', N'Обувь для вас', N'Rieker', N'Женская обувь', N'3', N'12', N'Туфли Rieker женские демисезонные, размер 36, цвет коричневый', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'D329H3', N'Полуботинки', N'шт.', N'1890', N'Обувь для вас', N'Alessio Nesca', N'Женская обувь', N'4', N'4', N'Полуботинки Alessio Nesca женские 3-30797-47, размер 37, цвет: бордовый', N'8.jpg')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'D364R4', N'Туфли', N'шт.', N'12400', N'Kari', N'Kari', N'Женская обувь', N'16', N'5', N'Туфли Luiza Belly женские Kate-lazo черные из натуральной замши', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'D572U8', N'Кроссовки', N'шт.', N'4100', N'Обувь для вас', N'Рос', N'Мужская обувь', N'3', N'6', N'129615-4 Кроссовки мужские', N'6.jpg')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'E482R4', N'Полуботинки', N'шт.', N'1800', N'Kari', N'Kari', N'Женская обувь', N'2', N'14', N'Полуботинки kari женские MYZ20S-149, размер 41, цвет: черный', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'F427R5', N'Ботинки', N'шт.', N'11800', N'Обувь для вас', N'Rieker', N'Женская обувь', N'15', N'11', N'Ботинки на молнии с декоративной пряжкой FRAU', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'F572H7', N'Туфли', N'шт.', N'2700', N'Kari', N'Marco Tozzi', N'Женская обувь', N'2', N'14', N'Туфли Marco Tozzi женские летние, размер 39, цвет черный', N'7.jpg')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'F635R4', N'Ботинки', N'шт.', N'3244', N'Обувь для вас', N'Marco Tozzi', N'Женская обувь', N'2', N'13', N'Ботинки Marco Tozzi женские демисезонные, размер 39, цвет бежевый', N'2.jpg')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'G432E4', N'Туфли', N'шт.', N'2800', N'Kari', N'Kari', N'Женская обувь', N'3', N'15', N'Туфли kari женские TR-YR-413017, размер 37, цвет: черный', N'10.jpg')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'G531F4', N'Ботинки', N'шт.', N'6600', N'Kari', N'Kari', N'Женская обувь', N'12', N'9', N'Ботинки женские зимние ROMER арт. 893167-01 Черный', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'G783F5', N'Ботинки', N'шт.', N'5900', N'Kari', N'Рос', N'Мужская обувь', N'2', N'8', N'Мужские ботинки Рос-Обувь кожаные с натуральным мехом', N'4.jpg')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'H535R5', N'Ботинки', N'шт.', N'2300', N'Обувь для вас', N'Rieker', N'Женская обувь', N'2', N'7', N'Женские Ботинки демисезонные', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'H782T5', N'Туфли', N'шт.', N'4499', N'Kari', N'Kari', N'Мужская обувь', N'4', N'5', N'Туфли kari мужские классика MYZ21AW-450A, размер 43, цвет: черный', N'3.jpg')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'J384T6', N'Ботинки', N'шт.', N'3800', N'Обувь для вас', N'Rieker', N'Мужская обувь', N'2', N'16', N'B3430/14 Полуботинки мужские Rieker', N'5.jpg')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'J542F5', N'Тапочки', N'шт.', N'500', N'Kari', N'Kari', N'Мужская обувь', N'13', N'0', N'Тапочки мужские Арт.70701-55-67син р.41', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'K345R4', N'Полуботинки', N'шт.', N'2100', N'Обувь для вас', N'CROSBY', N'Мужская обувь', N'2', N'3', N'407700/01-02 Полуботинки мужские CROSBY', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'K358H6', N'Тапочки', N'шт.', N'599', N'Kari', N'Rieker', N'Мужская обувь', N'20', N'2', N'Тапочки мужские син р.41', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'L754R4', N'Полуботинки', N'шт.', N'1700', N'Kari', N'Kari', N'Женская обувь', N'2', N'7', N'Полуботинки kari женские WB2020SS-26, размер 38, цвет: черный', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'M542T5', N'Кроссовки', N'шт.', N'2800', N'Обувь для вас', N'Rieker', N'Мужская обувь', N'18', N'3', N'Кроссовки мужские TOFA', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'N457T5', N'Полуботинки', N'шт.', N'4600', N'Kari', N'CROSBY', N'Женская обувь', N'3', N'13', N'Полуботинки Ботинки черные зимние, мех', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'O754F4', N'Туфли', N'шт.', N'5400', N'Обувь для вас', N'Rieker', N'Женская обувь', N'4', N'18', N'Туфли женские демисезонные Rieker артикул 55073-68/37', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'P764G4', N'Туфли', N'шт.', N'6800', N'Kari', N'CROSBY', N'Женская обувь', N'15', N'15', N'Туфли женские, ARGO, размер 38', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'S213E3', N'Полуботинки', N'шт.', N'2156', N'Обувь для вас', N'CROSBY', N'Мужская обувь', N'3', N'6', N'407700/01-01 Полуботинки мужские CROSBY', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'S326R5', N'Тапочки', N'шт.', N'9900', N'Обувь для вас', N'CROSBY', N'Мужская обувь', N'17', N'15', N'"Мужские кожаные тапочки ""Профиль С.Дали"" "', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'S634B5', N'Кеды', N'шт.', N'5500', N'Обувь для вас', N'CROSBY', N'Мужская обувь', N'3', N'0', N'Кеды Caprice мужские демисезонные, размер 42, цвет черный', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'T324F5', N'Сапоги', N'шт.', N'4699', N'Kari', N'CROSBY', N'Женская обувь', N'2', N'5', N'Сапоги замша Цвет: синий', N'')
GO
INSERT [dbo].[Товар] ([Артикул], [Наименование_товара], [Единица_измерения], [Цена], [Поставщик], [Производитель], [Категория_товара], [Действующая_скидка], [Количество], [Описание], [Фото]) VALUES (N'А112Т4', N'Ботинки', N'шт.', N'4990', N'Kari', N'Kari', N'Женская обувь', N'3', N'6', N'Женские Ботинки демисезонные kari', N'1.jpg')
GO
INSERT [dbo].[Пользователь] ([Код], [Роль], [ФИО], [Логин], [Пароль]) VALUES (11, N'Администратор', N'ХвостовИгорь', N'admin',N'12345')
GO
ALTER TABLE [dbo].[Заказ]  WITH CHECK ADD  CONSTRAINT [FK_Заказ_Пользователь] FOREIGN KEY([Код_пользователя])
REFERENCES [dbo].[Пользователь] ([Код])
GO
ALTER TABLE [dbo].[Заказ] CHECK CONSTRAINT [FK_Заказ_Пользователь]
GO
ALTER TABLE [dbo].[Заказ]  WITH CHECK ADD  CONSTRAINT [FK_Заказ_Пункт_выдачи] FOREIGN KEY([Код_пункта_выдачи])
REFERENCES [dbo].[Пункт_выдачи] ([Код])
GO
ALTER TABLE [dbo].[Заказ] CHECK CONSTRAINT [FK_Заказ_Пункт_выдачи]
GO
ALTER TABLE [dbo].[Заказ]  WITH CHECK ADD  CONSTRAINT [FK_Заказ_Товар] FOREIGN KEY([Артикул_товара])
REFERENCES [dbo].[Товар] ([Артикул])
GO
ALTER TABLE [dbo].[Заказ] CHECK CONSTRAINT [FK_Заказ_Товар]
GO
